// src/data/mockData.ts
export const mockDataArray = [
  {
    content: '성공은 최선을 다한 자만이 얻을 수 있다.',
    author: '박명수',
    tags: ['성공', '노력'],
  },
  {
    content: '꿈을 이루는 방법은 단 하나, 포기하지 않는 것이다.',
    author: '김연아',
    tags: ['꿈', '포기'],
  },
  {
    content: '행복은 우리가 함께하는 순간순간에 있다.',
    author: '조지 산타야나',
    tags: ['행복', '삶'],
  },
  {
    content:
      '진정한 성공은 남들에게 행복을 주는 것이다. 인생의 가장 큰 의미는 나 자신만을 위한 것이 아니라, 타인과 함께 나누는 것에 있다. 내가 가진 것들을 다른 사람들과 공유하고, 그들의 삶에 긍정적인 영향을 미칠 때, 진정한 성공을 이룬다고 할 수 있다.',
    author: '달라이 라마',
    tags: ['성공', '행복', '나눔'],
  },
  {
    content:
      '매일매일 작은 성공이 큰 성공으로 이어진다. 매일매일의 작은 목표를 세우고 이를 달성해 나가는 과정에서 우리는 큰 성공을 거둘 수 있는 능력을 키운다. 이 작은 성취들이 쌓여 결국에는 더 큰 성과를 이뤄낼 수 있도록 도와준다. 그러므로 매일 꾸준히 노력하는 것이 중요하다.',
    author: '앤드류 카네기',
    tags: ['성공', '일상', '노력'],
  },
  {
    content:
      '행복은 우리가 만들어가는 것이다. 행복은 외부의 조건이나 환경에 의해 결정되는 것이 아니라, 우리의 마음가짐과 행동에 따라 만들어진다. 긍정적인 생각을 가지고, 자신과 타인에 대해 친절하게 대하며, 매일매일 작은 것들에 감사하는 마음을 가지는 것이 행복을 만드는 핵심이다.',
    author: '소크라테스',
    tags: ['행복', '삶', '마음'],
  },
  {
    content: '작은 노력도 쌓이면 큰 결과를 만든다.',
    author: '피카소',
    tags: ['노력', '결과'],
  },
  {
    content: '인내는 성공의 가장 중요한 요소이다.',
    author: '윈스턴 처칠',
    tags: ['인내', '성공'],
  },
  {
    content: '행동이 말보다 더 많은 것을 말해준다.',
    author: '존 드라이든',
    tags: ['행동', '말'],
  },
  {
    content: '모든 위대한 변화는 작은 시작에서 시작된다.',
    author: '라오쯔',
    tags: ['변화', '시작'],
  },

  {
    content:
      '긍정적인 생각이 긍정적인 결과를 만든다. 우리의 생각은 우리의 행동과 결과에 큰 영향을 미친다. 긍정적인 마음가짐을 가지고, 스스로를 믿고, 도전하는 자세를 유지할 때, 우리는 더 나은 결과를 얻을 수 있다. 부정적인 생각은 우리의 발전을 저해할 뿐이다.',
    author: '윌리엄 제임스',
    tags: ['긍정', '생각', '결과'],
  },
  {
    content:
      '도전 없이는 성장이 없다. 우리는 새로운 도전과 시도를 통해서만 성장할 수 있다. 기존의 안락한 상태에 머무르면 아무런 발전이 없으며, 오히려 정체되어 있을 뿐이다. 새로운 도전을 받아들이고, 실패를 두려워하지 않는 것이 성장의 핵심이다.',
    author: '스티븐 코비',
    tags: ['도전', '성장', '발전'],
  },
];
