// src/data/mockData.ts
export const mockDataArray = [
  {
    content: '성공은 최선을 다한 자만이 얻을 수 있다.',
    author: '박명수',
    tags: ['성공', '노력'],
  },
  {
    content: '꿈을 이루는 방법은 단 하나, 포기하지 않는 것이다.',
    author: '김연아',
    tags: ['꿈', '포기'],
  },
  {
    content: '행복은 우리가 함께하는 순간순간에 있다.',
    author: '조지 산타야나',
    tags: ['행복', '삶'],
  },
  {
    content:
      '진정한 성공은 남들에게 행복을 주는 것이다. 인생의 가장 큰 의미는 나 자신만을 위한 것이 아니라, 타인과 함께 나누는 것에 있다. 내가 가진 것들을 다른 사람들과 공유하고, 그들의 삶에 긍정적인 영향을 미칠 때, 진정한 성공을 이룬다고 할 수 있다.',
    author: '달라이 라마',
    tags: ['성공', '행복', '나눔'],
  },
  {
    content:
      '매일매일 작은 성공이 큰 성공으로 이어진다. 매일매일의 작은 목표를 세우고 이를 달성해 나가는 과정에서 우리는 큰 성공을 거둘 수 있는 능력을 키운다. 이 작은 성취들이 쌓여 결국에는 더 큰 성과를 이뤄낼 수 있도록 도와준다. 그러므로 매일 꾸준히 노력하는 것이 중요하다.',
    author: '앤드류 카네기',
    tags: ['성공', '일상', '노력'],
  },
  {
    content:
      '행복은 우리가 만들어가는 것이다. 행복은 외부의 조건이나 환경에 의해 결정되는 것이 아니라, 우리의 마음가짐과 행동에 따라 만들어진다. 긍정적인 생각을 가지고, 자신과 타인에 대해 친절하게 대하며, 매일매일 작은 것들에 감사하는 마음을 가지는 것이 행복을 만드는 핵심이다.',
    author: '소크라테스',
    tags: ['행복', '삶', '마음'],
  },
  {
    content: '작은 노력도 쌓이면 큰 결과를 만든다.',
    author: '피카소',
    tags: ['노력', '결과'],
  },
  {
    content: '인내는 성공의 가장 중요한 요소이다.',
    author: '윈스턴 처칠',
    tags: ['인내', '성공'],
  },
  {
    content: '행동이 말보다 더 많은 것을 말해준다.',
    author: '존 드라이든',
    tags: ['행동', '말'],
  },
  {
    content: '모든 위대한 변화는 작은 시작에서 시작된다.',
    author: '라오쯔',
    tags: ['변화', '시작'],
  },

  {
    content:
      '긍정적인 생각이 긍정적인 결과를 만든다. 우리의 생각은 우리의 행동과 결과에 큰 영향을 미친다. 긍정적인 마음가짐을 가지고, 스스로를 믿고, 도전하는 자세를 유지할 때, 우리는 더 나은 결과를 얻을 수 있다. 부정적인 생각은 우리의 발전을 저해할 뿐이다.',
    author: '윌리엄 제임스',
    tags: ['긍정', '생각', '결과'],
  },
  {
    content:
      '도전 없이는 성장이 없다. 우리는 새로운 도전과 시도를 통해서만 성장할 수 있다. 기존의 안락한 상태에 머무르면 아무런 발전이 없으며, 오히려 정체되어 있을 뿐이다. 새로운 도전을 받아들이고, 실패를 두려워하지 않는 것이 성장의 핵심이다.',
    author: '스티븐 코비',
    tags: ['도전', '성장', '발전'],
  },
  //   {
  //     content:
  //       '기회는 준비된 자에게 온다. 기회는 우연히 찾아오는 것이 아니라, 준비된 마음과 능력을 가진 자에게만 주어진다. 우리가 목표를 세우고, 꾸준히 준비하며, 노력하는 자세를 유지할 때, 기회는 자연스럽게 찾아오게 된다. 따라서 준비는 성공의 필수 요소이다.',
  //     author: '루이 파스퇴르',
  //     tags: ['기회', '준비', '노력'],
  //   },
  //   {
  //     content:
  //       '자신의 꿈을 믿고 따라가라. 꿈을 이루기 위해서는 자신을 믿고, 목표를 향해 나아가는 것이 중요하다. 주변의 의견이나 어려움에 흔들리지 말고, 자신의 신념과 비전을 가지고 꾸준히 노력할 때, 꿈은 현실이 된다. 믿음과 열정이 성공의 열쇠다.',
  //     author: '헬렌 켈러',
  //     tags: ['꿈', '믿음', '열정'],
  //   },

  //   {
  //     content:
  //       '우리의 삶에서 가장 중요한 것은 우리의 태도와 마음가짐이다. 외부의 상황이나 환경에 따라 우리의 삶이 좌우되지 않도록, 긍정적인 태도를 유지하고, 항상 성장하고자 하는 마음가짐을 가지는 것이 중요하다.',
  //     author: '로저 베이컨',
  //     tags: ['태도', '마음가짐', '성장'],
  //   },
  //   {
  //     content:
  //       '성공은 주어진 기회가 아니라, 스스로 만들어가는 것이다. 주어진 기회에 의존하지 않고, 자신의 능력과 노력으로 기회를 만들어가야 한다. 성공은 단순히 운이 아닌, 자신의 끈기와 노력에 의해 이루어진다.',
  //     author: '마이클 조던',
  //     tags: ['성공', '기회', '노력'],
  //   },
  //   {
  //     content:
  //       '지금 이 순간을 즐기며 최선을 다하는 것이 진정한 삶의 의미이다. 우리는 종종 미래를 걱정하거나 과거를 회상하며 현재를 소홀히 하곤 한다. 하지만 진정한 행복과 만족은 지금 이 순간에 충실하고, 최선을 다할 때 찾아온다.',
  //     author: '하버트 스펜서',
  //     tags: ['현재', '행복', '삶'],
  //   },
];
